Revit 2027 API
BuiltInFailures.CopyPasteFailures.CantCopyFromDetailToProfileFam Property
 Can't copy Detail element(s) into a Profile family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantCopyFromDetailToProfileFam { get; }
Public Shared ReadOnly Property CantCopyFromDetailToProfileFam As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantCopyFromDetailToProfileFam {
	FailureDefinitionId^ get ();
}
static member CantCopyFromDetailToProfileFam : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace